<template>
    <section class="services">
      <div class="container">
        <h2 class="title">
            Что мы делаем
        </h2>
        <p class="description">
            Создаём продукты и визуальные системы под ключ. Берём на себя всё: от позиционирования и айдентики до UX/UI-дизайна, разработки и внедрения.
        </p>

        <div class="serviceCards">
        <ServiceCard
          v-for="(card, index) in serviceCards"
          :key="index"
          :title="card.title"
          :description="card.description"
          :points="card.points"
          :isInitiallyOpen="card.isInitiallyOpen"
        />
      </div>
      </div>
    </section>
</template>
  
<script setup lang="ts">
import ServiceCard from '../components/ServiceCard.vue';

const serviceCards = [
  {
    title: 'Упаковка digital-продуктов и брендов',
    description: 'Разрабатываем системы идентификации, в которых каждый элемент — от логотипа до дизайн-системы — работает на узнаваемость, масштабирование и единое позиционирование бренда.',
    points: [
        'Разработка фирменного стиля и логотипа',
        'Создание гайдлайнов и правил использования бренда',
        'Формирование визуальной идентичности продукта/бренда',
        'Разработка дизайн-систем и UI-китов для digital-продуктов',
        'Адаптация фирменного стиля под разные форматы (веб, мобильные приложения, печатная продукция)',
        'Консультации по позиционированию и брендингу',
        'Аудит существующей визуальной идентичности и рекомендации по улучшению'
    ],
    isInitiallyOpen: true
  },
  {
    title: 'UX/UI и продуктовый дизайн',
    description: 'Проектируем интерфейсы, которые не просто выглядят современно, а решают задачи продукта и бизнеса. Строим логику взаимодействия, улучшаем пользовательский опыт, внедряем масштабируемые визуальные системы.',
    points: [
        'UX/UI-дизайн веб-сервисов и B2B/B2C-платформ',
        'Дизайн мобильных и веб-приложений',
        'Дизайн лендингов',
        'Разработка UI-китов и дизайн-систем',
        'Концепты и MVP-дизайн для стартапов',
        'UX-исследования и тестирование гипотез',
        'UX/UI аудит и рекомендации по улучшению'
    ]
  },
  {
    title: 'Решения под ключ',
    description: 'Разрабатываем цифровые продукты с нуля — от аналитики и структуры до запуска. Обеспечиваем полный цикл: дизайн, разработка, внедрение, поддержка. Клиент получает готовый инструмент, заточенный под бизнес-задачи.',
    points: [
        'Анализ целевой аудитории и бизнес-процессов',
        'Проектирование архитектуры и структуры продукта',
        'UX/UI-дизайн интерфейсов',
        'Frontend и backend разработка',
        'Тестирование и оптимизация продукта перед запуском',
        'Подключение интеграций и API',
        'Техническая поддержка и дальнейшее развитие продукта'
    ]
  },
  {
    title: 'Креатив и маркетинговый дизайн',
    description: 'Создаём визуальные решения, которые работают на охват, вовлечение и продажи. Разрабатываем креативные концепции и адаптируем их под нужные форматы: от презентаций до digital-кампаний.',
    points: [
        'Разработка креативных концепций для рекламных кампаний',
        'Дизайн баннеров, постеров и других рекламных материалов',
        'Создание презентаций и pitch-документов',
        'Визуальное оформление социальных сетей (Instagram, Facebook, LinkedIn и др.)',
        'Разработка email-рассылок и лендингов',
        'Адаптация креатива под различные платформы и устройства',
        'Анализ эффективности дизайна и его корректировка'
    ]
  },
  {
    title: 'Дизайн-сопровождение и аутсорс',
    description: 'Закрываем задачи дизайна в режиме полного вовлечения. Работаем как внешний продуктовый дизайнер или команда — без микроменеджмента, с контролем качества и соблюдением сроков.',
    points: [
        'Постоянное сопровождение проекта на этапах роста и развития',
        'Разработка новых фич и обновлений интерфейса',
        'Создание макетов для рекламных кампаний и маркетинговых активностей',
        'Разработка UI-компонентов и их интеграция в дизайн-систему',
        'Оперативное решение нестандартных задач по дизайну',
        'Проведение регулярных UX-аудитов и оптимизация интерфейса',
        'Координация с командой разработки для реализации дизайна'
    ]
  }
]
</script>

<style scoped>
.services {
    width: 100%;
    box-sizing: border-box;
    padding: 32px 24px 32px;
}

.container {
    max-width: 1280px;
    margin: 0 auto;
}

.title {
    font-size: 30px;
    line-height: 38px;
    font-weight: 700;
    margin-bottom: 16px;
}

.description {
    font-size: 16px;
    line-height: 24px;
    margin-bottom: 32px;
}

.serviceCards {
    display: flex;
    flex-direction: column;
    gap: 16px;
}

@media (min-width: 768px) {
    .services {
        padding: 50px 24px;
    }

    .title {
        font-size: 64px;
        line-height: 64px;
        margin-bottom: 36px;
    }

    .description {
        width: 92%;
    }
}

@media (min-width: 992px) {
    .description {
        width: 75%;
    }
}

@media (min-width: 1280px) {
    .description {
        width: 62%;
    }
}
</style>